ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C2000/f280013x_access_protection_regs.xml
<module id="ACCESS_PROTECTION_REGS" HW_revision="" description="ACCESS PROTECTION Registers">
	<register id="MAVFLG" width="32" page="1" offset="0x20" internal="0" description="Master Access Violation Flag Register">
		<bitfield id="CPUFETCH" description="Master CPU Fetch Access Violation Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CPUWRITE" description="Master CPU Write Access Violation Flag" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="MAVSET" width="32" page="1" offset="0x22" internal="0" description="Master Access Violation Flag Set Register">
		<bitfield id="CPUFETCH" description="Master CPU Fetch Access Violation Flag Set" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRITE" description="Master CPU Write Access Violation Flag Set" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MAVCLR" width="32" page="1" offset="0x24" internal="0" description="Master Access Violation Flag Clear Register">
		<bitfield id="CPUFETCH" description="Master CPU Fetch Access Violation Flag Clear " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRITE" description="Master CPU Write Access Violation Flag Clear " begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MAVINTEN" width="32" page="1" offset="0x26" internal="0" description="Master Access Violation Interrupt Enable Register">
		<bitfield id="CPUFETCH" description="Master CPU Fetch Access Violation Interrupt Enable " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUWRITE" description="Master CPU Write Access Violation Interrupt Enable " begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCPUFAVADDR" width="32" page="1" offset="0x28" internal="0" description="Master CPU Fetch Access Violation Address">
		<bitfield id="MCPUFAVADDR" description="Master CPU fetch access violation address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="MCPUWRAVADDR" width="32" page="1" offset="0x2a" internal="0" description="Master CPU Write Access Violation Address">
		<bitfield id="MCPUWRAVADDR" description="Master CPU write access violation address register. " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
</module>
